*** crates/modeltap-core/src/domain/indicator.rs:114:5: replace other_tools_by_presence -> Vec<ToolId> with vec![]

*** mutation diff:
--- crates/modeltap-core/src/domain/indicator.rs
+++ replace other_tools_by_presence -> Vec<ToolId> with vec![]
@@ -106,22 +106,17 @@
 /// Presence-only variant — same as `other_tools_for_model` but takes an
 /// id-string instead of a full `DiscoveredModel`. Used by the render layer
 /// in 02-01.
 pub fn other_tools_by_presence(
     id_in_tool: &str,
     home: ToolId,
     inventory: &[ToolPresence],
 ) -> Vec<ToolId> {
-    inventory
-        .iter()
-        .filter(|t| t.tool != home)
-        .filter(|t| t.model_ids.iter().any(|id| id == id_in_tool))
-        .map(|t| t.tool)
-        .collect()
+    vec![] /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::types::{DisplayLabel, ModelStatus};
     use std::path::PathBuf;

---- domain::indicator::tests::other_tools_for_model_excludes_home_tool stdout ----

thread 'domain::indicator::tests::other_tools_for_model_excludes_home_tool' (71197573) panicked at crates/modeltap-core/src/domain/indicator.rs:207:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    domain::indicator::tests::other_tools_for_model_excludes_home_tool

test result: FAILED. 27 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
