*** crates/modeltap-core/src/domain/indicator.rs:116:28: replace != with == in other_tools_by_presence

*** mutation diff:
--- crates/modeltap-core/src/domain/indicator.rs
+++ replace != with == in other_tools_by_presence
@@ -108,17 +108,17 @@
 /// in 02-01.
 pub fn other_tools_by_presence(
     id_in_tool: &str,
     home: ToolId,
     inventory: &[ToolPresence],
 ) -> Vec<ToolId> {
     inventory
         .iter()
-        .filter(|t| t.tool != home)
+        .filter(|t| t.tool == /* ~ changed by cargo-mutants ~ */ home)
         .filter(|t| t.model_ids.iter().any(|id| id == id_in_tool))
         .map(|t| t.tool)
         .collect()
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;

---- domain::indicator::tests::other_tools_for_model_returns_empty_for_single_tool_registration stdout ----

thread 'domain::indicator::tests::other_tools_for_model_returns_empty_for_single_tool_registration' (71198383) panicked at crates/modeltap-core/src/domain/indicator.rs:223:9:
assertion failed: others.is_empty()

---- domain::indicator::tests::other_tools_for_model_excludes_home_tool stdout ----

thread 'domain::indicator::tests::other_tools_for_model_excludes_home_tool' (71198382) panicked at crates/modeltap-core/src/domain/indicator.rs:212:9:
assertion `left == right` failed
  left: 1
 right: 2

failures:
    domain::indicator::tests::other_tools_for_model_excludes_home_tool
    domain::indicator::tests::other_tools_for_model_returns_empty_for_single_tool_registration

test result: FAILED. 26 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
