*** crates/modeltap-core/src/domain/indicator.rs:117:52: replace == with != in other_tools_by_presence

*** mutation diff:
--- crates/modeltap-core/src/domain/indicator.rs
+++ replace == with != in other_tools_by_presence
@@ -109,17 +109,17 @@
 pub fn other_tools_by_presence(
     id_in_tool: &str,
     home: ToolId,
     inventory: &[ToolPresence],
 ) -> Vec<ToolId> {
     inventory
         .iter()
         .filter(|t| t.tool != home)
-        .filter(|t| t.model_ids.iter().any(|id| id == id_in_tool))
+        .filter(|t| t.model_ids.iter().any(|id| id != /* ~ changed by cargo-mutants ~ */ id_in_tool))
         .map(|t| t.tool)
         .collect()
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::types::{DisplayLabel, ModelStatus};

---- domain::indicator::tests::other_tools_for_model_excludes_home_tool stdout ----

thread 'domain::indicator::tests::other_tools_for_model_excludes_home_tool' (71199261) panicked at crates/modeltap-core/src/domain/indicator.rs:212:9:
assertion `left == right` failed
  left: 0
 right: 2

failures:
    domain::indicator::tests::other_tools_for_model_excludes_home_tool

test result: FAILED. 27 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
