*** crates/modeltap-core/src/domain/indicator.rs:85:52: replace == with != in classify_by_presence

*** mutation diff:
--- crates/modeltap-core/src/domain/indicator.rs
+++ replace == with != in classify_by_presence
@@ -77,17 +77,17 @@
 
 /// Presence-only half of the classifier — assumes the format is parseable.
 /// Used by the render layer in 02-01 when only id-strings are plumbed through
 /// the view-model. 02-05 will make the full `DiscoveredModel` available end-
 /// to-end so the format-aware `classify_row` can be called from render code.
 pub fn classify_by_presence(id_in_tool: &str, inventory: &[ToolPresence]) -> RowIndicator {
     let count = inventory
         .iter()
-        .filter(|t| t.model_ids.iter().any(|id| id == id_in_tool))
+        .filter(|t| t.model_ids.iter().any(|id| id != /* ~ changed by cargo-mutants ~ */ id_in_tool))
         .count();
     if count >= 2 {
         RowIndicator::Shared
     } else {
         RowIndicator::Compatible
     }
 }

---- domain::indicator::tests::classify_row_returns_shared_when_three_tools_have_the_same_model stdout ----

thread 'domain::indicator::tests::classify_row_returns_shared_when_three_tools_have_the_same_model' (71195175) panicked at crates/modeltap-core/src/domain/indicator.rs:175:9:
assertion `left == right` failed
  left: Compatible
 right: Shared

---- domain::indicator::tests::classify_row_returns_shared_when_two_tools_have_the_same_model stdout ----

thread 'domain::indicator::tests::classify_row_returns_shared_when_two_tools_have_the_same_model' (71195176) panicked at crates/modeltap-core/src/domain/indicator.rs:164:9:
assertion `left == right` failed
  left: Compatible
 right: Shared

---- domain::indicator::tests::property_shared_iff_present_in_two_or_more_tools_for_parseable_format stdout ----

thread 'domain::indicator::tests::property_shared_iff_present_in_two_or_more_tools_for_parseable_format' (71195181) panicked at crates/modeltap-core/src/domain/indicator.rs:259:17:
assertion `left == right` failed: format=Gguf n=2 expected=Shared got=Compatible
  left: Compatible
 right: Shared

failures:
    domain::indicator::tests::classify_row_returns_shared_when_three_tools_have_the_same_model
    domain::indicator::tests::classify_row_returns_shared_when_two_tools_have_the_same_model
    domain::indicator::tests::property_shared_iff_present_in_two_or_more_tools_for_parseable_format

test result: FAILED. 25 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
