*** crates/modeltap-core/src/domain/indicator.rs:87:14: replace >= with < in classify_by_presence

*** mutation diff:
--- crates/modeltap-core/src/domain/indicator.rs
+++ replace >= with < in classify_by_presence
@@ -79,17 +79,17 @@
 /// Used by the render layer in 02-01 when only id-strings are plumbed through
 /// the view-model. 02-05 will make the full `DiscoveredModel` available end-
 /// to-end so the format-aware `classify_row` can be called from render code.
 pub fn classify_by_presence(id_in_tool: &str, inventory: &[ToolPresence]) -> RowIndicator {
     let count = inventory
         .iter()
         .filter(|t| t.model_ids.iter().any(|id| id == id_in_tool))
         .count();
-    if count >= 2 {
+    if count < /* ~ changed by cargo-mutants ~ */ 2 {
         RowIndicator::Shared
     } else {
         RowIndicator::Compatible
     }
 }
 
 /// Collect the `ToolId`s of tools (other than the model's home tool) that
 /// also have this model registered. Drives the `also in: <list>` annotation

---- domain::indicator::tests::classify_row_returns_shared_when_two_tools_have_the_same_model stdout ----

thread 'domain::indicator::tests::classify_row_returns_shared_when_two_tools_have_the_same_model' (71195967) panicked at crates/modeltap-core/src/domain/indicator.rs:164:9:
assertion `left == right` failed
  left: Compatible
 right: Shared

---- domain::indicator::tests::property_shared_iff_present_in_two_or_more_tools_for_parseable_format stdout ----

thread 'domain::indicator::tests::property_shared_iff_present_in_two_or_more_tools_for_parseable_format' (71195972) panicked at crates/modeltap-core/src/domain/indicator.rs:259:17:
assertion `left == right` failed: format=Gguf n=0 expected=Compatible got=Shared
  left: Shared
 right: Compatible

---- domain::indicator::tests::classify_row_returns_shared_when_three_tools_have_the_same_model stdout ----

thread 'domain::indicator::tests::classify_row_returns_shared_when_three_tools_have_the_same_model' (71195966) panicked at crates/modeltap-core/src/domain/indicator.rs:175:9:
assertion `left == right` failed
  left: Compatible
 right: Shared

failures:
    domain::indicator::tests::classify_row_returns_compatible_for_empty_inventory
    domain::indicator::tests::classify_row_returns_compatible_when_only_one_tool_has_the_model
    domain::indicator::tests::classify_row_returns_shared_when_three_tools_have_the_same_model
    domain::indicator::tests::classify_row_returns_shared_when_two_tools_have_the_same_model
    domain::indicator::tests::property_shared_iff_present_in_two_or_more_tools_for_parseable_format

test result: FAILED. 23 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
