*** crates/modeltap-core/src/domain/last_action.rs:135:9: replace LastAction::for_zap_partial -> Self with Default::default()

*** mutation diff:
--- crates/modeltap-core/src/domain/last_action.rs
+++ replace LastAction::for_zap_partial -> Self with Default::default()
@@ -127,27 +127,17 @@
     /// Construct a partial-success banner for a zap. Some targets succeeded,
     /// some failed. `bytes_reclaimed` is the bytes freed by the successes.
     pub fn for_zap_partial(
         tool_id: ToolId,
         bytes_reclaimed: u64,
         successes: u64,
         failures: Vec<TargetError>,
     ) -> Self {
-        Self {
-            verb: ActionVerb::Zap,
-            target: tool_id.0.to_string(),
-            status: ActionStatus::Partial {
-                successes,
-                failures,
-            },
-            bytes_reclaimed,
-            bytes_retained: 0,
-            extra: None,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Construct a success banner for a confirmed unify (US-10). The
     /// `target` is the model's display label / id (NOT a tool id — unify
     /// acts on a single model across multiple tools). The `extra` line
     /// renders "1 inode, N hardlinks" per the US-06 scenario.
     pub fn for_unify_success(target: String, bytes_reclaimed: u64, hardlink_count: usize) -> Self {
         Self {

error[E0277]: the trait bound `LastAction: Default` is not satisfied
   --> crates/modeltap-core/src/domain/last_action.rs:135:9
    |
135 |         Default::default() /* ~ changed by cargo-mutants ~ */
    |         ^^^^^^^^^^^^^^^^^^ unsatisfied trait bound
    |
help: the trait `Default` is not implemented for `LastAction`
   --> crates/modeltap-core/src/domain/last_action.rs:79:1
    |
 79 | pub struct LastAction {
    | ^^^^^^^^^^^^^^^^^^^^^

*** result: Failure(101)
