*** crates/modeltap-core/src/domain/last_action.rs:167:9: replace LastAction::for_unify_already_unified -> Self with Default::default()

*** mutation diff:
--- crates/modeltap-core/src/domain/last_action.rs
+++ replace LastAction::for_unify_already_unified -> Self with Default::default()
@@ -159,26 +159,17 @@
             extra: Some(format!("1 inode, {hardlink_count} hardlinks")),
         }
     }
 
     /// Construct an "already unified" banner. The unify dialog opened in
     /// AlreadyUnified mode and the user dismissed; we record an
     /// informational success-with-zero-reclaim banner.
     pub fn for_unify_already_unified(target: String, hardlink_count: usize) -> Self {
-        Self {
-            verb: ActionVerb::Unify,
-            target,
-            status: ActionStatus::Success,
-            bytes_reclaimed: 0,
-            bytes_retained: 0,
-            extra: Some(format!(
-                "already unified: 1 inode, {hardlink_count} hardlinks"
-            )),
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Construct a partial-success banner for a unify. Used by 03-03 (cross-fs).
     pub fn for_unify_partial(
         target: String,
         bytes_reclaimed: u64,
         successes: u64,
         failures: Vec<TargetError>,

error[E0277]: the trait bound `LastAction: Default` is not satisfied
   --> crates/modeltap-core/src/domain/last_action.rs:167:9
    |
167 |         Default::default() /* ~ changed by cargo-mutants ~ */
    |         ^^^^^^^^^^^^^^^^^^ unsatisfied trait bound
    |
help: the trait `Default` is not implemented for `LastAction`
   --> crates/modeltap-core/src/domain/last_action.rs:79:1
    |
 79 | pub struct LastAction {
    | ^^^^^^^^^^^^^^^^^^^^^

*** result: Failure(101)
