*** crates/modeltap-core/src/domain/last_action.rs:186:9: replace LastAction::for_unify_partial -> Self with Default::default()

*** mutation diff:
--- crates/modeltap-core/src/domain/last_action.rs
+++ replace LastAction::for_unify_partial -> Self with Default::default()
@@ -178,27 +178,17 @@
 
     /// Construct a partial-success banner for a unify. Used by 03-03 (cross-fs).
     pub fn for_unify_partial(
         target: String,
         bytes_reclaimed: u64,
         successes: u64,
         failures: Vec<TargetError>,
     ) -> Self {
-        Self {
-            verb: ActionVerb::Unify,
-            target,
-            status: ActionStatus::Partial {
-                successes,
-                failures,
-            },
-            bytes_reclaimed,
-            bytes_retained: 0,
-            extra: None,
-        }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Construct a failure banner for a unify that errored before any work
     /// (or where every target failed).
     pub fn for_unify_failed(target: String) -> Self {
         Self {
             verb: ActionVerb::Unify,
             target,

error[E0277]: the trait bound `LastAction: Default` is not satisfied
   --> crates/modeltap-core/src/domain/last_action.rs:186:9
    |
186 |         Default::default() /* ~ changed by cargo-mutants ~ */
    |         ^^^^^^^^^^^^^^^^^^ unsatisfied trait bound
    |
help: the trait `Default` is not implemented for `LastAction`
   --> crates/modeltap-core/src/domain/last_action.rs:79:1
    |
 79 | pub struct LastAction {
    | ^^^^^^^^^^^^^^^^^^^^^

*** result: Failure(101)
