*** crates/modeltap-core/src/domain/last_action.rs:28:9: replace ActionVerb::as_str -> &'static str with ""

*** mutation diff:
--- crates/modeltap-core/src/domain/last_action.rs
+++ replace ActionVerb::as_str -> &'static str with ""
@@ -20,21 +20,17 @@
 pub enum ActionVerb {
     Zap,
     Unify,
     Delete,
 }
 
 impl ActionVerb {
     pub fn as_str(&self) -> &'static str {
-        match self {
-            ActionVerb::Zap => "zap",
-            ActionVerb::Unify => "unify",
-            ActionVerb::Delete => "delete",
-        }
+        "" /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// What happened. `Success` for full success, `Partial` for partial-success
 /// (some targets succeeded, some failed — used by 03-03 cross-fs unify),
 /// `Failed` for full failure.
 #[derive(Debug, Clone, Eq, PartialEq)]
 pub enum ActionStatus {

*** result: Success
