*** crates/modeltap-core/src/domain/last_action.rs:53:9: replace ActionStatus::header_label -> String with String::new()

*** mutation diff:
--- crates/modeltap-core/src/domain/last_action.rs
+++ replace ActionStatus::header_label -> String with String::new()
@@ -45,27 +45,17 @@
     },
     Failed,
 }
 
 impl ActionStatus {
     /// Short form for the header parenthetical: "success" / "failed" /
     /// "partial: N of M targets linked".
     pub fn header_label(&self) -> String {
-        match self {
-            ActionStatus::Success => "success".to_string(),
-            ActionStatus::Failed => "failed".to_string(),
-            ActionStatus::Partial {
-                successes,
-                failures,
-            } => {
-                let total = successes + failures.len() as u64;
-                format!("partial: {} of {} targets linked", successes, total)
-            }
-        }
+        String::new() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// One target's failure detail for partial-success messages. Used by 03-03
 /// (cross-fs unify) to show "the failed target's path and reason" per the
 /// master-acceptance scenario. WS slice never produces this.
 #[derive(Debug, Clone, Eq, PartialEq)]
 pub struct TargetError {

*** result: Success
