*** crates/modeltap-core/src/domain/last_action.rs:60:39: replace + with - in ActionStatus::header_label

*** mutation diff:
--- crates/modeltap-core/src/domain/last_action.rs
+++ replace + with - in ActionStatus::header_label
@@ -52,17 +52,17 @@
     pub fn header_label(&self) -> String {
         match self {
             ActionStatus::Success => "success".to_string(),
             ActionStatus::Failed => "failed".to_string(),
             ActionStatus::Partial {
                 successes,
                 failures,
             } => {
-                let total = successes + failures.len() as u64;
+                let total = successes - /* ~ changed by cargo-mutants ~ */ failures.len() as u64;
                 format!("partial: {} of {} targets linked", successes, total)
             }
         }
     }
 }
 
 /// One target's failure detail for partial-success messages. Used by 03-03
 /// (cross-fs unify) to show "the failed target's path and reason" per the

*** result: Success
