*** crates/modeltap-core/src/logic/canonical_selector.rs:59:5: replace select_canonical -> Option<&CandidatePath> with None

*** mutation diff:
--- crates/modeltap-core/src/logic/canonical_selector.rs
+++ replace select_canonical -> Option<&CandidatePath> with None
@@ -51,30 +51,17 @@
 
 /// Pick the canonical path from a slice of candidates. Returns `None` when
 /// no candidate exists on disk (the unify action is then not applicable).
 ///
 /// See the module docstring for the full ranking rules. This function is
 /// its own driving port — calling it directly in tests IS port-to-port
 /// testing per the `nw-tdd-methodology` convention.
 pub fn select_canonical(candidates: &[CandidatePath]) -> Option<&CandidatePath> {
-    candidates.iter().filter(|c| c.exists).max_by(|a, b| {
-        // Largest size_bytes first. `Ord::cmp` returns Greater when the
-        // left is larger; we want the largest to be "max", so the natural
-        // ordering works — but `max_by` needs a comparator that reflects
-        // "a > b" by returning Greater. So compare a vs b directly.
-        a.size_bytes
-            .cmp(&b.size_bytes)
-            // Prefer Ollama-blob paths (true > false).
-            .then_with(|| a.is_ollama_blob.cmp(&b.is_ollama_blob))
-            // Lexicographic — but inverted because `max_by` keeps the
-            // greater. We want the *smaller* path lexicographically as
-            // canonical for stability across runs ⇒ invert.
-            .then_with(|| b.path.cmp(&a.path))
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn cand(
         tool: &'static str,

---- logic::canonical_selector::tests::single_existing_candidate_is_picked stdout ----

thread 'logic::canonical_selector::tests::single_existing_candidate_is_picked' (71207326) panicked at crates/modeltap-core/src/logic/canonical_selector.rs:145:44:
called `Option::unwrap()` on a `None` value

---- logic::canonical_selector::tests::returns_only_existing_when_others_missing stdout ----

thread 'logic::canonical_selector::tests::returns_only_existing_when_others_missing' (71207325) panicked at crates/modeltap-core/src/logic/canonical_selector.rs:97:44:
called `Option::unwrap()` on a `None` value

---- logic::canonical_selector::tests::final_tiebreak_is_deterministic_lexicographic stdout ----

thread 'logic::canonical_selector::tests::final_tiebreak_is_deterministic_lexicographic' (71207322) panicked at crates/modeltap-core/src/logic/canonical_selector.rs:132:44:
called `Option::unwrap()` on a `None` value

failures:
    logic::canonical_selector::tests::final_tiebreak_is_deterministic_lexicographic
    logic::canonical_selector::tests::prefers_largest_existing_candidate
    logic::canonical_selector::tests::returns_only_existing_when_others_missing
    logic::canonical_selector::tests::single_existing_candidate_is_picked
    logic::canonical_selector::tests::tiebreaks_equal_size_in_favor_of_ollama_blob

test result: FAILED. 23 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
