*** crates/modeltap-core/src/logic/compatibility.rs:114:5: replace has_dedup_match_in_other_tool -> bool with true

*** mutation diff:
--- crates/modeltap-core/src/logic/compatibility.rs
+++ replace has_dedup_match_in_other_tool -> bool with true
@@ -106,21 +106,17 @@
 }
 
 /// True if the inventory contains some entry — in a tool DIFFERENT from
 /// `target.tool` — whose dedup-key matches the target's. Per ADR-002 the
 /// dedup-key match is **conservative-when-uncertain**: if either side's
 /// SHA256 is `None`, the engine returns `false` (NOT shared). This preserves
 /// the safety invariant that we never silently overstate compatibility.
 fn has_dedup_match_in_other_tool(target: &InventoryEntry, inventory: &Inventory) -> bool {
-    inventory
-        .entries
-        .iter()
-        .filter(|e| e.tool != target.tool)
-        .any(|peer| is_dedup_key_match(target, peer))
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 /// Pure dedup-key match between two inventory entries. Per ADR-002
 /// (conservative-when-uncertain rule): if either side's content hash is
 /// `None`, we are NOT confident the entries are byte-identical — return
 /// `false`. SHA256-equality is the only positive match we accept here.
 ///
 /// HF id+quant fallback is intentionally not yet implemented; the

---- single_tool_format_accepted_by_other_plugin_yields_compatible stdout ----

thread 'single_tool_format_accepted_by_other_plugin_yields_compatible' (71208181) panicked at crates/modeltap-core/tests/compatibility_property.rs:98:5:
assertion `left == right` failed
  left: Shared
 right: Compatible

---- sha256_absent_does_not_yield_shared_when_uncertain stdout ----

thread 'sha256_absent_does_not_yield_shared_when_uncertain' (71208180) panicked at crates/modeltap-core/tests/compatibility_property.rs:184:5:
assertion `left != right` failed: ADR-002 conservative-when-uncertain: no SHA256 + no fallback match → must NOT be Shared
  left: Shared
 right: Shared

---- single_tool_no_other_plugin_accepts_format_yields_format_locked stdout ----

thread 'single_tool_no_other_plugin_accepts_format_yields_format_locked' (71208182) panicked at crates/modeltap-core/tests/compatibility_property.rs:120:5:
assertion `left == right` failed
  left: Shared
 right: FormatLocked

failures:
    sha256_absent_does_not_yield_shared_when_uncertain
    single_tool_format_accepted_by_other_plugin_yields_compatible
    single_tool_no_other_plugin_accepts_format_yields_format_locked

test result: FAILED. 4 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
