*** crates/modeltap-core/src/logic/compatibility.rs:114:5: replace has_dedup_match_in_other_tool -> bool with false

*** mutation diff:
--- crates/modeltap-core/src/logic/compatibility.rs
+++ replace has_dedup_match_in_other_tool -> bool with false
@@ -106,21 +106,17 @@
 }
 
 /// True if the inventory contains some entry — in a tool DIFFERENT from
 /// `target.tool` — whose dedup-key matches the target's. Per ADR-002 the
 /// dedup-key match is **conservative-when-uncertain**: if either side's
 /// SHA256 is `None`, the engine returns `false` (NOT shared). This preserves
 /// the safety invariant that we never silently overstate compatibility.
 fn has_dedup_match_in_other_tool(target: &InventoryEntry, inventory: &Inventory) -> bool {
-    inventory
-        .entries
-        .iter()
-        .filter(|e| e.tool != target.tool)
-        .any(|peer| is_dedup_key_match(target, peer))
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Pure dedup-key match between two inventory entries. Per ADR-002
 /// (conservative-when-uncertain rule): if either side's content hash is
 /// `None`, we are NOT confident the entries are byte-identical — return
 /// `false`. SHA256-equality is the only positive match we accept here.
 ///
 /// HF id+quant fallback is intentionally not yet implemented; the

---- matching_sha256_in_two_tools_yields_shared stdout ----

thread 'matching_sha256_in_two_tools_yields_shared' (71208988) panicked at crates/modeltap-core/tests/compatibility_property.rs:83:5:
assertion `left == right` failed
  left: Compatible
 right: Shared

failures:
    matching_sha256_in_two_tools_yields_shared

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
