*** crates/modeltap-core/src/logic/compatibility.rs:117:28: replace != with == in has_dedup_match_in_other_tool

*** mutation diff:
--- crates/modeltap-core/src/logic/compatibility.rs
+++ replace != with == in has_dedup_match_in_other_tool
@@ -109,17 +109,17 @@
 /// `target.tool` — whose dedup-key matches the target's. Per ADR-002 the
 /// dedup-key match is **conservative-when-uncertain**: if either side's
 /// SHA256 is `None`, the engine returns `false` (NOT shared). This preserves
 /// the safety invariant that we never silently overstate compatibility.
 fn has_dedup_match_in_other_tool(target: &InventoryEntry, inventory: &Inventory) -> bool {
     inventory
         .entries
         .iter()
-        .filter(|e| e.tool != target.tool)
+        .filter(|e| e.tool == /* ~ changed by cargo-mutants ~ */ target.tool)
         .any(|peer| is_dedup_key_match(target, peer))
 }
 
 /// Pure dedup-key match between two inventory entries. Per ADR-002
 /// (conservative-when-uncertain rule): if either side's content hash is
 /// `None`, we are NOT confident the entries are byte-identical — return
 /// `false`. SHA256-equality is the only positive match we accept here.
 ///

---- single_tool_no_other_plugin_accepts_format_yields_format_locked stdout ----

thread 'single_tool_no_other_plugin_accepts_format_yields_format_locked' (71209796) panicked at crates/modeltap-core/tests/compatibility_property.rs:120:5:
assertion `left == right` failed
  left: Shared
 right: FormatLocked

---- single_tool_format_accepted_by_other_plugin_yields_compatible stdout ----

thread 'single_tool_format_accepted_by_other_plugin_yields_compatible' (71209795) panicked at crates/modeltap-core/tests/compatibility_property.rs:98:5:
assertion `left == right` failed
  left: Shared
 right: Compatible

failures:
    single_tool_format_accepted_by_other_plugin_yields_compatible
    single_tool_no_other_plugin_accepts_format_yields_format_locked

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
