*** crates/modeltap-core/src/logic/compatibility.rs:150:5: replace any_other_plugin_accepts -> bool with true

*** mutation diff:
--- crates/modeltap-core/src/logic/compatibility.rs
+++ replace any_other_plugin_accepts -> bool with true
@@ -142,13 +142,10 @@
 /// True if some plugin OTHER than `target_tool` declares `format` in its
 /// `accepted_formats()`. Plugins with empty `accepted_formats()` cannot
 /// accept anything (vacuously) so they don't contribute to compatibility.
 fn any_other_plugin_accepts(
     target_tool: ToolId,
     format: Format,
     plugin_capabilities: &PluginCapabilityMap,
 ) -> bool {
-    plugin_capabilities
-        .iter()
-        .filter(|(tool, _)| **tool != target_tool)
-        .any(|(_, fmts)| fmts.contains(&format))
+    true /* ~ changed by cargo-mutants ~ */
 }

---- single_tool_no_other_plugin_accepts_format_yields_format_locked stdout ----

thread 'single_tool_no_other_plugin_accepts_format_yields_format_locked' (71213892) panicked at crates/modeltap-core/tests/compatibility_property.rs:120:5:
assertion `left == right` failed
  left: Compatible
 right: FormatLocked

failures:
    single_tool_no_other_plugin_accepts_format_yields_format_locked

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
