*** crates/modeltap-core/src/logic/compatibility.rs:150:5: replace any_other_plugin_accepts -> bool with false

*** mutation diff:
--- crates/modeltap-core/src/logic/compatibility.rs
+++ replace any_other_plugin_accepts -> bool with false
@@ -142,13 +142,10 @@
 /// True if some plugin OTHER than `target_tool` declares `format` in its
 /// `accepted_formats()`. Plugins with empty `accepted_formats()` cannot
 /// accept anything (vacuously) so they don't contribute to compatibility.
 fn any_other_plugin_accepts(
     target_tool: ToolId,
     format: Format,
     plugin_capabilities: &PluginCapabilityMap,
 ) -> bool {
-    plugin_capabilities
-        .iter()
-        .filter(|(tool, _)| **tool != target_tool)
-        .any(|(_, fmts)| fmts.contains(&format))
+    false /* ~ changed by cargo-mutants ~ */
 }

---- sha256_absent_does_not_yield_shared_when_uncertain stdout ----

thread 'sha256_absent_does_not_yield_shared_when_uncertain' (71214849) panicked at crates/modeltap-core/tests/compatibility_property.rs:192:5:
assertion `left == right` failed
  left: FormatLocked
 right: Compatible

---- single_tool_format_accepted_by_other_plugin_yields_compatible stdout ----

thread 'single_tool_format_accepted_by_other_plugin_yields_compatible' (71214850) panicked at crates/modeltap-core/tests/compatibility_property.rs:98:5:
assertion `left == right` failed
  left: FormatLocked
 right: Compatible

failures:
    sha256_absent_does_not_yield_shared_when_uncertain
    single_tool_format_accepted_by_other_plugin_yields_compatible

test result: FAILED. 5 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
