*** crates/modeltap-core/src/logic/compatibility.rs:152:36: replace != with == in any_other_plugin_accepts

*** mutation diff:
--- crates/modeltap-core/src/logic/compatibility.rs
+++ replace != with == in any_other_plugin_accepts
@@ -144,11 +144,11 @@
 /// accept anything (vacuously) so they don't contribute to compatibility.
 fn any_other_plugin_accepts(
     target_tool: ToolId,
     format: Format,
     plugin_capabilities: &PluginCapabilityMap,
 ) -> bool {
     plugin_capabilities
         .iter()
-        .filter(|(tool, _)| **tool != target_tool)
+        .filter(|(tool, _)| **tool == /* ~ changed by cargo-mutants ~ */ target_tool)
         .any(|(_, fmts)| fmts.contains(&format))
 }

---- single_tool_no_other_plugin_accepts_format_yields_format_locked stdout ----

thread 'single_tool_no_other_plugin_accepts_format_yields_format_locked' (71215675) panicked at crates/modeltap-core/tests/compatibility_property.rs:120:5:
assertion `left == right` failed
  left: Compatible
 right: FormatLocked

failures:
    single_tool_no_other_plugin_accepts_format_yields_format_locked

test result: FAILED. 6 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.04s

*** result: Failure(101)
