*** crates/modeltap-core/src/logic/dedup.rs:82:19: replace != with == in classify_unique_vs_shared

*** mutation diff:
--- crates/modeltap-core/src/logic/dedup.rs
+++ replace != with == in classify_unique_vs_shared
@@ -74,17 +74,17 @@
     let mut report = UniqueVsSharedReport {
         unique_count: 0,
         shared_count: 0,
         unique_bytes: 0,
         shared_bytes: 0,
     };
 
     for m in inventory {
-        if m.tool != *tool_id {
+        if m.tool == /* ~ changed by cargo-mutants ~ */ *tool_id {
             continue;
         }
         // Shared iff some OTHER tool also references this exact path.
         let referenced_by_others = path_tools
             .get(&m.on_disk_path)
             .map(|tools| tools.iter().any(|t| t != tool_id))
             .unwrap_or(false);
         if referenced_by_others {

---- tool_not_present_in_inventory_returns_zeros stdout ----

thread 'tool_not_present_in_inventory_returns_zeros' (71216581) panicked at crates/modeltap-core/tests/dedup_classifier.rs:87:5:
assertion `left == right` failed
  left: 1
 right: 0

---- cross_tool_same_path_classifies_as_shared stdout ----

thread 'cross_tool_same_path_classifies_as_shared' (71216578) panicked at crates/modeltap-core/tests/dedup_classifier.rs:60:5:
assertion `left == right` failed: llama3 unique to ollama
  left: 0
 right: 1

---- single_tool_inventory_classifies_all_models_as_unique stdout ----

thread 'single_tool_inventory_classifies_all_models_as_unique' (71216580) panicked at crates/modeltap-core/tests/dedup_classifier.rs:42:5:
assertion `left == right` failed: all 3 models unique to ollama
  left: 0
 right: 3

failures:
    cross_tool_same_path_classifies_as_shared
    single_tool_inventory_classifies_all_models_as_unique
    tool_not_present_in_inventory_returns_zeros

test result: FAILED. 1 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
