*** crates/modeltap-core/src/logic/dedup.rs:88:49: replace != with == in classify_unique_vs_shared

*** mutation diff:
--- crates/modeltap-core/src/logic/dedup.rs
+++ replace != with == in classify_unique_vs_shared
@@ -80,17 +80,17 @@
 
     for m in inventory {
         if m.tool != *tool_id {
             continue;
         }
         // Shared iff some OTHER tool also references this exact path.
         let referenced_by_others = path_tools
             .get(&m.on_disk_path)
-            .map(|tools| tools.iter().any(|t| t != tool_id))
+            .map(|tools| tools.iter().any(|t| t == /* ~ changed by cargo-mutants ~ */ tool_id))
             .unwrap_or(false);
         if referenced_by_others {
             report.shared_count = report.shared_count.saturating_add(1);
             report.shared_bytes = report.shared_bytes.saturating_add(m.size_bytes);
         } else {
             report.unique_count = report.unique_count.saturating_add(1);
             report.unique_bytes = report.unique_bytes.saturating_add(m.size_bytes);
         }

---- single_tool_inventory_classifies_all_models_as_unique stdout ----

thread 'single_tool_inventory_classifies_all_models_as_unique' (71217397) panicked at crates/modeltap-core/tests/dedup_classifier.rs:42:5:
assertion `left == right` failed: all 3 models unique to ollama
  left: 0
 right: 3

---- cross_tool_same_path_classifies_as_shared stdout ----

thread 'cross_tool_same_path_classifies_as_shared' (71217395) panicked at crates/modeltap-core/tests/dedup_classifier.rs:60:5:
assertion `left == right` failed: llama3 unique to ollama
  left: 0
 right: 1

failures:
    cross_tool_same_path_classifies_as_shared
    single_tool_inventory_classifies_all_models_as_unique

test result: FAILED. 2 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
