*** crates/modeltap-core/src/logic/plan.rs:75:5: replace build_plan -> Option<UnifyPlan> with None

*** mutation diff:
--- crates/modeltap-core/src/logic/plan.rs
+++ replace build_plan -> Option<UnifyPlan> with None
@@ -67,54 +67,17 @@
 
 /// Construct a unify plan. `canonical` is the source; `targets` is the slice
 /// of all candidates (the canonical may appear in `targets`; it will be
 /// filtered out).
 ///
 /// Returns `None` if `canonical` does not exist on disk — the unify action
 /// is not applicable in that case.
 pub fn build_plan(canonical: &PlanCandidate, targets: &[PlanCandidate]) -> Option<UnifyPlan> {
-    if !canonical.exists {
-        return None;
-    }
-
-    let mut links: Vec<PlannedLink> = Vec::new();
-    let mut inodes_replaced: HashSet<(u64, u64)> = HashSet::new();
-
-    for t in targets {
-        if t.path == canonical.path {
-            continue; // canonical itself
-        }
-        if !t.exists {
-            // Missing target: skip silently. The acceptance contract says
-            // unify operates on currently-registered models; a vanished
-            // file is the orchestrator's concern, not the planner's.
-            continue;
-        }
-        let already_linked = t.device == canonical.device && t.inode == canonical.inode;
-        let cross_filesystem = t.device != canonical.device;
-        if !already_linked {
-            inodes_replaced.insert((t.device, t.inode));
-        }
-        links.push(PlannedLink {
-            tool: t.tool,
-            target: t.path.clone(),
-            cross_filesystem,
-            already_linked,
-        });
-    }
-
-    let bytes_reclaimed_estimate =
-        (inodes_replaced.len() as u64).saturating_mul(canonical.size_bytes);
-
-    Some(UnifyPlan {
-        canonical: canonical.clone(),
-        links,
-        bytes_reclaimed_estimate,
-    })
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     fn cand(
         tool: &'static str,

---- logic::plan::tests::computes_bytes_reclaimed_per_unique_inode stdout ----

thread 'logic::plan::tests::computes_bytes_reclaimed_per_unique_inode' (71218181) panicked at crates/modeltap-core/src/logic/plan.rs:151:53:
called `Option::unwrap()` on a `None` value

---- logic::plan::tests::empty_targets_yields_empty_plan_with_zero_reclaim stdout ----

thread 'logic::plan::tests::empty_targets_yields_empty_plan_with_zero_reclaim' (71218182) panicked at crates/modeltap-core/src/logic/plan.rs:176:48:
called `Option::unwrap()` on a `None` value

---- logic::plan::tests::excludes_canonical_from_link_list stdout ----

thread 'logic::plan::tests::excludes_canonical_from_link_list' (71218183) panicked at crates/modeltap-core/src/logic/plan.rs:114:53:
called `Option::unwrap()` on a `None` value

failures:
    logic::plan::tests::computes_bytes_reclaimed_per_unique_inode
    logic::plan::tests::empty_targets_yields_empty_plan_with_zero_reclaim
    logic::plan::tests::excludes_canonical_from_link_list
    logic::plan::tests::flags_already_linked_when_inodes_match
    logic::plan::tests::flags_cross_filesystem_when_devices_differ
    logic::plan::tests::skips_missing_targets

test result: FAILED. 22 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
