*** crates/modeltap-core/src/logic/plan.rs:75:8: delete ! in build_plan

*** mutation diff:
--- crates/modeltap-core/src/logic/plan.rs
+++ delete ! in build_plan
@@ -67,17 +67,17 @@
 
 /// Construct a unify plan. `canonical` is the source; `targets` is the slice
 /// of all candidates (the canonical may appear in `targets`; it will be
 /// filtered out).
 ///
 /// Returns `None` if `canonical` does not exist on disk — the unify action
 /// is not applicable in that case.
 pub fn build_plan(canonical: &PlanCandidate, targets: &[PlanCandidate]) -> Option<UnifyPlan> {
-    if !canonical.exists {
+    if  /* ~ changed by cargo-mutants ~ */canonical.exists {
         return None;
     }
 
     let mut links: Vec<PlannedLink> = Vec::new();
     let mut inodes_replaced: HashSet<(u64, u64)> = HashSet::new();
 
     for t in targets {
         if t.path == canonical.path {

---- logic::plan::tests::flags_already_linked_when_inodes_match stdout ----

thread 'logic::plan::tests::flags_already_linked_when_inodes_match' (71219003) panicked at crates/modeltap-core/src/logic/plan.rs:160:53:
called `Option::unwrap()` on a `None` value

---- logic::plan::tests::computes_bytes_reclaimed_per_unique_inode stdout ----

thread 'logic::plan::tests::computes_bytes_reclaimed_per_unique_inode' (71219000) panicked at crates/modeltap-core/src/logic/plan.rs:188:53:
called `Option::unwrap()` on a `None` value

---- logic::plan::tests::excludes_canonical_from_link_list stdout ----

thread 'logic::plan::tests::excludes_canonical_from_link_list' (71219002) panicked at crates/modeltap-core/src/logic/plan.rs:151:53:
called `Option::unwrap()` on a `None` value

failures:
    logic::plan::tests::computes_bytes_reclaimed_per_unique_inode
    logic::plan::tests::empty_targets_yields_empty_plan_with_zero_reclaim
    logic::plan::tests::excludes_canonical_from_link_list
    logic::plan::tests::flags_already_linked_when_inodes_match
    logic::plan::tests::flags_cross_filesystem_when_devices_differ
    logic::plan::tests::returns_none_when_canonical_missing
    logic::plan::tests::skips_missing_targets

test result: FAILED. 21 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
