*** crates/modeltap-core/src/logic/plan.rs:83:19: replace == with != in build_plan

*** mutation diff:
--- crates/modeltap-core/src/logic/plan.rs
+++ replace == with != in build_plan
@@ -75,17 +75,17 @@
     if !canonical.exists {
         return None;
     }
 
     let mut links: Vec<PlannedLink> = Vec::new();
     let mut inodes_replaced: HashSet<(u64, u64)> = HashSet::new();
 
     for t in targets {
-        if t.path == canonical.path {
+        if t.path != /* ~ changed by cargo-mutants ~ */ canonical.path {
             continue; // canonical itself
         }
         if !t.exists {
             // Missing target: skip silently. The acceptance contract says
             // unify operates on currently-registered models; a vanished
             // file is the orchestrator's concern, not the planner's.
             continue;
         }

---- logic::plan::tests::computes_bytes_reclaimed_per_unique_inode stdout ----

thread 'logic::plan::tests::computes_bytes_reclaimed_per_unique_inode' (71219801) panicked at crates/modeltap-core/src/logic/plan.rs:189:9:
assertion `left == right` failed
  left: 0
 right: 3

---- logic::plan::tests::excludes_canonical_from_link_list stdout ----

thread 'logic::plan::tests::excludes_canonical_from_link_list' (71219803) panicked at crates/modeltap-core/src/logic/plan.rs:153:9:
assertion `left == right` failed
  left: ToolId("ollama")
 right: ToolId("hf")

---- logic::plan::tests::flags_already_linked_when_inodes_match stdout ----

thread 'logic::plan::tests::flags_already_linked_when_inodes_match' (71219804) panicked at crates/modeltap-core/src/logic/plan.rs:161:9:
assertion `left == right` failed
  left: 0
 right: 1

failures:
    logic::plan::tests::computes_bytes_reclaimed_per_unique_inode
    logic::plan::tests::excludes_canonical_from_link_list
    logic::plan::tests::flags_already_linked_when_inodes_match
    logic::plan::tests::flags_cross_filesystem_when_devices_differ
    logic::plan::tests::skips_missing_targets

test result: FAILED. 23 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
