*** crates/modeltap-core/src/logic/plan.rs:93:41: replace != with == in build_plan

*** mutation diff:
--- crates/modeltap-core/src/logic/plan.rs
+++ replace != with == in build_plan
@@ -85,17 +85,17 @@
         }
         if !t.exists {
             // Missing target: skip silently. The acceptance contract says
             // unify operates on currently-registered models; a vanished
             // file is the orchestrator's concern, not the planner's.
             continue;
         }
         let already_linked = t.device == canonical.device && t.inode == canonical.inode;
-        let cross_filesystem = t.device != canonical.device;
+        let cross_filesystem = t.device == /* ~ changed by cargo-mutants ~ */ canonical.device;
         if !already_linked {
             inodes_replaced.insert((t.device, t.inode));
         }
         links.push(PlannedLink {
             tool: t.tool,
             target: t.path.clone(),
             cross_filesystem,
             already_linked,

---- logic::plan::tests::flags_already_linked_when_inodes_match stdout ----

thread 'logic::plan::tests::flags_already_linked_when_inodes_match' (71223748) panicked at crates/modeltap-core/src/logic/plan.rs:163:9:
assertion failed: !plan.links[0].cross_filesystem

---- logic::plan::tests::flags_cross_filesystem_when_devices_differ stdout ----

thread 'logic::plan::tests::flags_cross_filesystem_when_devices_differ' (71223749) panicked at crates/modeltap-core/src/logic/plan.rs:176:9:
assertion failed: plan.links[0].cross_filesystem

failures:
    logic::plan::tests::flags_already_linked_when_inodes_match
    logic::plan::tests::flags_cross_filesystem_when_devices_differ

test result: FAILED. 26 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
