*** crates/modeltap-core/src/logic/plan.rs:94:12: delete ! in build_plan

*** mutation diff:
--- crates/modeltap-core/src/logic/plan.rs
+++ delete ! in build_plan
@@ -86,17 +86,17 @@
         if !t.exists {
             // Missing target: skip silently. The acceptance contract says
             // unify operates on currently-registered models; a vanished
             // file is the orchestrator's concern, not the planner's.
             continue;
         }
         let already_linked = t.device == canonical.device && t.inode == canonical.inode;
         let cross_filesystem = t.device != canonical.device;
-        if !already_linked {
+        if  /* ~ changed by cargo-mutants ~ */already_linked {
             inodes_replaced.insert((t.device, t.inode));
         }
         links.push(PlannedLink {
             tool: t.tool,
             target: t.path.clone(),
             cross_filesystem,
             already_linked,
         });

---- logic::plan::tests::computes_bytes_reclaimed_per_unique_inode stdout ----

thread 'logic::plan::tests::computes_bytes_reclaimed_per_unique_inode' (71224523) panicked at crates/modeltap-core/src/logic/plan.rs:191:9:
assertion `left == right` failed
  left: 0
 right: 2048

---- logic::plan::tests::flags_already_linked_when_inodes_match stdout ----

thread 'logic::plan::tests::flags_already_linked_when_inodes_match' (71224526) panicked at crates/modeltap-core/src/logic/plan.rs:164:9:
assertion `left == right` failed: no replacement work to do
  left: 1024
 right: 0

failures:
    logic::plan::tests::computes_bytes_reclaimed_per_unique_inode
    logic::plan::tests::flags_already_linked_when_inodes_match

test result: FAILED. 26 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
