*** crates/modeltap-core/src/logic/unification_status.rs:106:9: delete match arm 0 in compute_unification_status

*** mutation diff:
--- crates/modeltap-core/src/logic/unification_status.rs
+++ delete match arm 0 in compute_unification_status
@@ -98,17 +98,17 @@
 // ---------------------------------------------------------------------------
 
 /// Compute the unification status from a list of registrations. Pure. ADR-002
 /// conservative-when-uncertain rule: missing inodes → treat as distinct
 /// copies (preserve data — never overstate sharing).
 pub fn compute_unification_status(regs: &[DetailRegistration]) -> UnificationStatus {
     let n = regs.len();
     match n {
-        0 => UnificationStatus::SingleTool, // pathological — render as if 1
+         /* ~ changed by cargo-mutants ~ */ // pathological — render as if 1
         1 => UnificationStatus::SingleTool,
         _ => classify_multi(regs),
     }
 }
 
 /// Classify when there are 2+ registrations.
 fn classify_multi(regs: &[DetailRegistration]) -> UnificationStatus {
     // Collect known inodes; treat any None as a distinct "ghost" inode (per

*** result: Success
