*** crates/modeltap-core/src/logic/unification_status.rs:107:9: delete match arm 1 in compute_unification_status

*** mutation diff:
--- crates/modeltap-core/src/logic/unification_status.rs
+++ delete match arm 1 in compute_unification_status
@@ -99,17 +99,17 @@
 
 /// Compute the unification status from a list of registrations. Pure. ADR-002
 /// conservative-when-uncertain rule: missing inodes → treat as distinct
 /// copies (preserve data — never overstate sharing).
 pub fn compute_unification_status(regs: &[DetailRegistration]) -> UnificationStatus {
     let n = regs.len();
     match n {
         0 => UnificationStatus::SingleTool, // pathological — render as if 1
-        1 => UnificationStatus::SingleTool,
+         /* ~ changed by cargo-mutants ~ */
         _ => classify_multi(regs),
     }
 }
 
 /// Classify when there are 2+ registrations.
 fn classify_multi(regs: &[DetailRegistration]) -> UnificationStatus {
     // Collect known inodes; treat any None as a distinct "ghost" inode (per
     // ADR-002 conservative rule — preserve data when uncertain).

---- one_registration_yields_single_tool_status stdout ----

thread 'one_registration_yields_single_tool_status' (71226313) panicked at crates/modeltap-core/tests/unification_status.rs:41:5:
1 registration must yield SingleTool, got Unified { hardlink_count: 1 }

failures:
    one_registration_yields_single_tool_status

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
