*** crates/modeltap-core/src/logic/unification_status.rs:121:25: replace == with != in classify_multi

*** mutation diff:
--- crates/modeltap-core/src/logic/unification_status.rs
+++ replace == with != in classify_multi
@@ -113,17 +113,17 @@
 fn classify_multi(regs: &[DetailRegistration]) -> UnificationStatus {
     // Collect known inodes; treat any None as a distinct "ghost" inode (per
     // ADR-002 conservative rule — preserve data when uncertain).
     let inodes: Vec<Option<u64>> = regs.iter().map(|r| r.inode).collect();
 
     // If ALL inodes are Some and equal → Unified.
     if inodes.iter().all(|i| i.is_some()) {
         let unique: HashSet<u64> = inodes.iter().filter_map(|i| *i).collect();
-        if unique.len() == 1 {
+        if unique.len() != /* ~ changed by cargo-mutants ~ */ 1 {
             return UnificationStatus::Unified {
                 hardlink_count: regs.len(),
             };
         }
         if unique.len() == regs.len() {
             return UnificationStatus::NotUnified {
                 copy_count: regs.len(),
             };

---- mixed_inodes_yield_partially_unified_status stdout ----

thread 'mixed_inodes_yield_partially_unified_status' (71227189) panicked at crates/modeltap-core/tests/unification_status.rs:116:18:
expected PartiallyUnified, got Unified { hardlink_count: 3 }

---- distinct_inodes_yield_not_unified_status stdout ----

thread 'distinct_inodes_yield_not_unified_status' (71227187) panicked at crates/modeltap-core/tests/unification_status.rs:90:18:
expected NotUnified, got Unified { hardlink_count: 3 }

---- all_registrations_with_same_inode_yield_unified_status stdout ----

thread 'all_registrations_with_same_inode_yield_unified_status' (71227186) panicked at crates/modeltap-core/tests/unification_status.rs:67:18:
expected Unified, got PartiallyUnified { shared_count: 3, total_count: 3, distinct_inodes: 1 }

failures:
    all_registrations_with_same_inode_yield_unified_status
    distinct_inodes_yield_not_unified_status
    mixed_inodes_yield_partially_unified_status
    unified_carries_hardlink_count_for_render

test result: FAILED. 6 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
