*** crates/modeltap-core/src/logic/unification_status.rs:126:25: replace == with != in classify_multi

*** mutation diff:
--- crates/modeltap-core/src/logic/unification_status.rs
+++ replace == with != in classify_multi
@@ -118,17 +118,17 @@
     // If ALL inodes are Some and equal → Unified.
     if inodes.iter().all(|i| i.is_some()) {
         let unique: HashSet<u64> = inodes.iter().filter_map(|i| *i).collect();
         if unique.len() == 1 {
             return UnificationStatus::Unified {
                 hardlink_count: regs.len(),
             };
         }
-        if unique.len() == regs.len() {
+        if unique.len() != /* ~ changed by cargo-mutants ~ */ regs.len() {
             return UnificationStatus::NotUnified {
                 copy_count: regs.len(),
             };
         }
         // Mixed: some share, some don't.
         let shared_count = compute_shared_count(&inodes);
         return UnificationStatus::PartiallyUnified {
             shared_count,

---- mixed_inodes_yield_partially_unified_status stdout ----

thread 'mixed_inodes_yield_partially_unified_status' (71228063) panicked at crates/modeltap-core/tests/unification_status.rs:116:18:
expected PartiallyUnified, got NotUnified { copy_count: 3 }

---- distinct_inodes_yield_not_unified_status stdout ----

thread 'distinct_inodes_yield_not_unified_status' (71228061) panicked at crates/modeltap-core/tests/unification_status.rs:90:18:
expected NotUnified, got PartiallyUnified { shared_count: 0, total_count: 3, distinct_inodes: 3 }

failures:
    distinct_inodes_yield_not_unified_status
    mixed_inodes_yield_partially_unified_status

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
