*** crates/modeltap-core/src/logic/unification_status.rs:155:38: replace && with || in compute_shared_count

*** mutation diff:
--- crates/modeltap-core/src/logic/unification_status.rs
+++ replace && with || in compute_shared_count
@@ -147,17 +147,17 @@
 /// registration.
 fn compute_shared_count(inodes: &[Option<u64>]) -> usize {
     let mut count = 0;
     for (i, ino) in inodes.iter().enumerate() {
         let Some(this) = ino else { continue };
         let shared_with_another = inodes
             .iter()
             .enumerate()
-            .any(|(j, other)| j != i && other.as_ref() == Some(this));
+            .any(|(j, other)| j != i || /* ~ changed by cargo-mutants ~ */ other.as_ref() == Some(this));
         if shared_with_another {
             count += 1;
         }
     }
     count
 }
 
 /// Compute the reclaim estimate in bytes for a given status + canonical size.

---- mixed_inodes_yield_partially_unified_status stdout ----

thread 'mixed_inodes_yield_partially_unified_status' (71230646) panicked at crates/modeltap-core/tests/unification_status.rs:112:13:
assertion `left == right` failed: 2 paths share an inode
  left: 3
 right: 2

failures:
    mixed_inodes_yield_partially_unified_status

test result: FAILED. 9 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
