*** crates/modeltap-core/src/logic/unification_status.rs:166:5: replace compute_reclaim_estimate -> u64 with 0

*** mutation diff:
--- crates/modeltap-core/src/logic/unification_status.rs
+++ replace compute_reclaim_estimate -> u64 with 0
@@ -158,19 +158,10 @@
         }
     }
     count
 }
 
 /// Compute the reclaim estimate in bytes for a given status + canonical size.
 /// Pure. See module docstring for the formula table.
 pub fn compute_reclaim_estimate(status: &UnificationStatus, canonical_size_bytes: u64) -> u64 {
-    match status {
-        UnificationStatus::SingleTool => 0,
-        UnificationStatus::Unified { .. } => 0,
-        UnificationStatus::NotUnified { copy_count } => {
-            (copy_count.saturating_sub(1) as u64).saturating_mul(canonical_size_bytes)
-        }
-        UnificationStatus::PartiallyUnified {
-            distinct_inodes, ..
-        } => (distinct_inodes.saturating_sub(1) as u64).saturating_mul(canonical_size_bytes),
-    }
+    0 /* ~ changed by cargo-mutants ~ */
 }

---- reclaim_estimate_for_not_unified_is_count_minus_one_times_canonical stdout ----

thread 'reclaim_estimate_for_not_unified_is_count_minus_one_times_canonical' (71234864) panicked at crates/modeltap-core/tests/unification_status.rs:156:5:
assertion `left == right` failed: NotUnified: (3 copies - 1) * 4.4 GB = 8.8 GB
  left: 0
 right: 8800000000

---- reclaim_estimate_for_partially_unified_uses_distinct_inodes stdout ----

thread 'reclaim_estimate_for_partially_unified_uses_distinct_inodes' (71234865) panicked at crates/modeltap-core/tests/unification_status.rs:178:5:
assertion `left == right` failed: PartiallyUnified: (2 distinct - 1) * 4.4 GB = 4.4 GB
  left: 0
 right: 4400000000

failures:
    reclaim_estimate_for_not_unified_is_count_minus_one_times_canonical
    reclaim_estimate_for_partially_unified_uses_distinct_inodes

test result: FAILED. 8 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
