*** crates/modeltap-core/src/ports/fs_probe.rs:103:9: replace FsProbe::device_id -> Option<u64> with Some(1)

*** mutation diff:
--- crates/modeltap-core/src/ports/fs_probe.rs
+++ replace FsProbe::device_id -> Option<u64> with Some(1)
@@ -95,17 +95,17 @@
             _ => false,
         }
     }
 
     /// The device id (`dev_t`) of `path`, or `None` if the path cannot be
     /// statted. Useful for callers that need just the device part without the
     /// inode (e.g., per-target cross-fs flagging in `build_plan`).
     fn device_id(&self, path: &Path) -> Option<u64> {
-        self.dev_and_inode(path).map(|(d, _)| d)
+        Some(1) /* ~ changed by cargo-mutants ~ */
     }
 
     /// The inode (`ino_t`) of `path`, or `None` if the path cannot be statted.
     /// Useful for callers that need just the inode part without the device
     /// (e.g., post-action invariant checks on inode equality).
     fn inode(&self, path: &Path) -> Option<u64> {
         self.dev_and_inode(path).map(|(_, i)| i)
     }

---- ports::fs_probe::tests::device_id_returns_dev_when_present stdout ----

thread 'ports::fs_probe::tests::device_id_returns_dev_when_present' (71241433) panicked at crates/modeltap-core/src/ports/fs_probe.rs:191:9:
assertion `left == right` failed
  left: Some(1)
 right: Some(7)

failures:
    ports::fs_probe::tests::device_id_returns_dev_when_present

test result: FAILED. 27 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
