*** crates/modeltap-core/src/ports/fs_probe.rs:110:9: replace FsProbe::inode -> Option<u64> with Some(0)

*** mutation diff:
--- crates/modeltap-core/src/ports/fs_probe.rs
+++ replace FsProbe::inode -> Option<u64> with Some(0)
@@ -102,17 +102,17 @@
     fn device_id(&self, path: &Path) -> Option<u64> {
         self.dev_and_inode(path).map(|(d, _)| d)
     }
 
     /// The inode (`ino_t`) of `path`, or `None` if the path cannot be statted.
     /// Useful for callers that need just the inode part without the device
     /// (e.g., post-action invariant checks on inode equality).
     fn inode(&self, path: &Path) -> Option<u64> {
-        self.dev_and_inode(path).map(|(_, i)| i)
+        Some(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Detect any running tool processes that hold one or more of
     /// `target_paths` open. Used by the unify and delete-one orchestrators
     /// (US-17, intake Q5) to refuse mutating actions while a registered
     /// tool's process has a file in scope. The action is gated:
     /// when this returns `Ok(non_empty)`, the orchestrator MUST raise the
     /// running-tool dialog and refuse the action until the user closes the

---- ports::fs_probe::tests::inode_returns_ino_when_present stdout ----

thread 'ports::fs_probe::tests::inode_returns_ino_when_present' (71243011) panicked at crates/modeltap-core/src/ports/fs_probe.rs:198:9:
assertion `left == right` failed
  left: Some(0)
 right: Some(42)

failures:
    ports::fs_probe::tests::inode_returns_ino_when_present

test result: FAILED. 27 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
